In [10]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [49]:
df = pd.read_csv('friend_list.csv')

In [50]:
df.head()

    name  age        job  Unnamed: 3
0   John   20    student         NaN
1  Jenny   30  developer         NaN
2   Nate   30    teacher         NaN
3  Julia   40    dentist         NaN
4  Brian   45    manager         NaN

In [51]:
df[2:4]

    name  age      job  Unnamed: 3
2   Nate   30  teacher         NaN
3  Julia   40  dentist         NaN

In [54]:
df[0:2]

    name  age        job  Unnamed: 3
0   John   20    student         NaN
1  Jenny   30  developer         NaN

In [55]:
df.loc[[0,4]]

    name  age      job  Unnamed: 3
0   John   20  student         NaN
4  Brian   45  manager         NaN

In [56]:
df[df.age<30]

    name  age      job  Unnamed: 3
0   John   20  student         NaN
5  Chris   25   intern         NaN

In [63]:
df[df.name=='John']

   name  age      job  Unnamed: 3
0  John   20  student         NaN

In [65]:
df.iloc[:, [0,2]]

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher
3  Julia    dentist
4  Brian    manager
5  Chris     intern

In [66]:
df[['age','job']]

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [67]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [68]:
df['job']

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [69]:
df[['job']]

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [78]:
df

    name  age        job  Unnamed: 3
0   John   20    student         NaN
1  Jenny   30  developer         NaN
2   Nate   30    teacher         NaN
3  Julia   40    dentist         NaN
4  Brian   45    manager         NaN
5  Chris   25     intern         NaN

In [85]:
df.drop(df.index[1:4])

    name  age      job  Unnamed: 3
0   John   20  student         NaN
4  Brian   45  manager         NaN
5  Chris   25   intern         NaN

In [86]:
df.drop(df.index[[1,3]])

    name  age      job  Unnamed: 3
0   John   20  student         NaN
2   Nate   30  teacher         NaN
4  Brian   45  manager         NaN
5  Chris   25   intern         NaN

In [88]:
df.drop(df.index[1])

    name  age      job  Unnamed: 3
0   John   20  student         NaN
2   Nate   30  teacher         NaN
3  Julia   40  dentist         NaN
4  Brian   45  manager         NaN
5  Chris   25   intern         NaN

In [90]:
df

    name  age        job  Unnamed: 3
0   John   20    student         NaN
1  Jenny   30  developer         NaN
2   Nate   30    teacher         NaN
3  Julia   40    dentist         NaN
4  Brian   45    manager         NaN
5  Chris   25     intern         NaN

In [91]:
df.drop(['name','job'],axis=1)

   age  Unnamed: 3
0   20         NaN
1   30         NaN
2   30         NaN
3   40         NaN
4   45         NaN
5   25         NaN

In [92]:
df['salary']=[1,2,3,4,5,6]

In [96]:
df=df.drop('Unnamed: 3',axis=1)

In [99]:
df.head()

    name  age        job  salary
0   John   20    student       1
1  Jenny   30  developer       2
2   Nate   30    teacher       3
3  Julia   40    dentist       4
4  Brian   45    manager       5

In [108]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list,columns=['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20